/* 1. Написать функцию loop, которая будет принимать параметры: times (значение по умолчанию = 0), callback (значение по умолчанию = null) и будет в цикле (times раз), вызывать функцию callback. Если функцию не передана, то цикл не должен отрабатывать ни разу. Покажите применение этой функции */

const loop = (times = 0, callback = null) => {
    if (times == 0 || callback == null) {
        console.log('pip');
    } else {
        for (let x = 1; x <= times; x++) {
            console.log(callback);
        }
    }
};

loop(5, 6);

/* 2. Написать функцию calculateArea, которая будет принимать параметры, для вычисления площади (можете выбрать какую то конкретную фигуру, а можете, основываясь на переданных параметрах, выполнять требуемый алгоритм вычисления площади для переданной в параметрах фигуры) и возвращать объект вида: { area, figure, input }, где area - вычисленная площадь, figure - название фигуры, для которой вычислялась площадь, input - входные параметры, по которым было произведено вычисление. */

const calculateArea = (width, height) => {
    return( {
        area: width*height,
        figure: 'square',
        input: [width,height]
    })
};

console.log(calculateArea(4,5))
